CSI API ETABS v1

# cDStIndian_IS_800_2007SetPreference Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDStIndian_IS_800_2007
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32

Value

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cDStIndian_IS_800_2007 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com